Tekla Open API Reference for Tekla Structures 2025
Operation.Group Method
 Groups a list of single rebars or rebar groups and creates a new rebar group.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static RebarGroup Group(
	IEnumerable RebarList
)
Public Shared Function Group (
	RebarList As IEnumerable
) As RebarGroup
Parameters
RebarList
Type: System.Collections.IEnumerable
The list of single rebars and rebar groups to be grouped.
Return Value
Type: RebarGroup
The created rebar group on success, null on failure.
See Also
Reference
Operation Class
Tekla.Structures.Model.Operations Namespace